scc2425-project-71903-71911/src/main/artillery/likes/like.yml
config:
  target:  "http://localhost:8080/tukano/rest"
  phases:
    - name: like a short
      duration: 3
      arrivalRate: 1

scenarios:
  #Assuming short exists
  - name: "like"
    flow:
      - post:
          url: "/likes/5+99425014-9e60-47ad-940e-fda6d494ad64/5/likes?pwd=123"
          json: true